In [22]:
import pandas as pd
import pyodbc

In [23]:
conn=pyodbc.connect( 
                       'HOST=localhost;'
                       'DATABASE=django;'
                       'UID=root;'
                       'PWD=tiger;'
                       )
query="SELECT * FROM professor"
output=pd.read_sql(query,conn)

InterfaceError: ('IM002', '[IM002] [Microsoft][ODBC Driver Manager] Data source name not found and no default driver specified (0) (SQLDriverConnect)')

In [16]:
import mysql.connector as sql

import pandas as pd

db_connection = sql.connect(host='localhost', database='django', user='root', password='tiger')

db_cursor = db_connection.cursor()

db_cursor.execute('SELECT * FROM professor')

table_rows = db_cursor.fetchall()

df = pd.DataFrame(table_rows)

In [5]:
df[1]=df[1].str.strip()

In [17]:
df

    0                  1  2      3
0   1    Nancy Daniels\t  4   7169
1   2       Billy Knight  1   9793
2   3        Harry Myers  4  25194
3   4  Antonio Rodriguez  3   9686
4   5        Nicole Gome  2  30860
5   6    \tEugene George  5  10487
6   7     Gloria Vasquez  4   6353
7   8       Joyce Flores  1  25796
8   9     Daniel Gilbert  5  35678
9  10    Matthew Stevens  2  26648

In [15]:
db_cursor.execute('DELETE FROM professor where DEPT_ID=2')


# table_rows2 = db_cursor.fetchall()

# df2 = pd.DataFrame(table_rows2)

In [14]:
df2

    0                1  2      3
0   5      Nicole Gome  2  30860
1  10  Matthew Stevens  2  26648